Revit 2027 API
BuiltInFailures.RebarFailures.InvalidRebarHostFamilyCanHostRebarParam Property
 Rebar can't be placed in this Generic Model element because rebar hosting is disabled in the family [Name].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidRebarHostFamilyCanHostRebarParam { get; }
Public Shared ReadOnly Property InvalidRebarHostFamilyCanHostRebarParam As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidRebarHostFamilyCanHostRebarParam {
	FailureDefinitionId^ get ();
}
static member InvalidRebarHostFamilyCanHostRebarParam : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace